Revit 2027 API
EndTreatmentType.Create(Document) Method
 Creates a new EndTreatmentType in the specified document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static EndTreatmentType Create(
	Document doc
)
Public Shared Function Create (
	doc As Document
) As EndTreatmentType
public:
static EndTreatmentType^ Create(
	Document^ doc
)
static member Create :
        doc : Document -> EndTreatmentType
Parameters
doc Document
 A Document.
Return Value
EndTreatmentType
 Returns the newly created EndTreatmentType in the specified document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EndTreatmentType Class
Create Overload
Autodesk.Revit.DB.Structure Namespace